In [2]:
import pandas as pd
import numpy as np

In [3]:
nd = np.arange(15).reshape((5, 3))
nd
df1 = pd.DataFrame(nd, columns=['one', 'two', 'three'])
df1

   one  two  three
0    0    1      2
1    3    4      5
2    6    7      8
3    9   10     11
4   12   13     14

In [4]:
df1.values

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

In [5]:
df1.head(2)

   one  two  three
0    0    1      2
1    3    4      5

In [6]:
df1.tail(2)

   one  two  three
3    9   10     11
4   12   13     14

In [7]:
df1.empty

False

In [8]:
df1.size

15

In [9]:
df1.ndim

2

In [10]:
df1.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['one', 'two', 'three'], dtype='object')]

In [11]:
df1.T

       0  1  2   3   4
one    0  3  6   9  12
two    1  4  7  10  13
three  2  5  8  11  14

In [12]:
df1.shape

(5, 3)

In [13]:
df1.sum()

one      30
two      35
three    40
dtype: int64

In [14]:
df1.cumsum()

   one  two  three
0    0    1      2
1    3    5      7
2    9   12     15
3   18   22     26
4   30   35     40

In [15]:
df1.mean()

one      6.0
two      7.0
three    8.0
dtype: float64

In [16]:
df1.std()

one      4.743416
two      4.743416
three    4.743416
dtype: float64

In [17]:
df1.count()

one      5
two      5
three    5
dtype: int64

In [18]:
df1.median()

one      6.0
two      7.0
three    8.0
dtype: float64

In [19]:
df1.min()

one      0
two      1
three    2
dtype: int32

In [20]:
df1.max()

one      12
two      13
three    14
dtype: int32

In [21]:
df1.mode()

   one  two  three
0    0    1      2
1    3    4      5
2    6    7      8
3    9   10     11
4   12   13     14

In [73]:
df1.prod()

one          0
two       3640
three    12320
dtype: int32

In [22]:
df1.cumprod()

   one   two  three
0    0     1      2
1    0     4     10
2    0    28     80
3    0   280    880
4    0  3640  12320